cwl0127/STM32F439IGT6_for_Arduino/Generic_F439IG/variant.h
#define PG5  101 // | 101                                                                                                                              |             
#define PG6  102 // | 102                                                                                                                              |             
#define PG7  103 // | 103                                                                                                                              |     
#define PG8  104 // | 104                                                                                                                              |                       
#define PG9  105 // | 105                                                                                                                              | 
#define PG10 106 // | 106                                                                                                                              |         
#define PG11 107 // | 107     |                                                                                                                        | 
#define PG12 108 // | 108     |                                                                                                                        | 
#define PG13 109 // | 109     |                                                                                                                        |             
#define PG14 110 // | 110     |                                                                                                                        | 
#define PG15 111 // | 111     |                                                                                                                        |                   
//                  |---------|------------|------------|-----------------------|----------------------|-----------------------------------|-----------|
#define PH0  112 // | 112     |            |            |                       |                      |                                   | OSC_IN    |
#define PH1  113 // | 113     |            |            |                       |                      |                                   | OSC_OUT   |
#define PH2  114
#define PH3  115
#define PH4  116
#define PH5  117
#define PH6  118
#define PH7  119
#define PH8  120
#define PH9  121
#define PH10 122
#define PH11 123
#define PH12 124
#define PH13 125
#define PH14 126
#define PH15 127

#define PI0  128
#define PI1  129
#define PI2  130
#define PI3  131
#define PI4  132
#define PI5  133
#define PI6  134
#define PI7  135
#define PI8  136
#define PI9  137
#define PI10 138
#define PI11 139
//                  |---------|------------|------------|-----------------------|----------------------|-----------------------------------|-----------|


// This must be a literal
#define NUM_DIGITAL_PINS        140
// This must be a literal with a value less than or equal to to MAX_ANALOG_INPUTS
#define NUM_ANALOG_INPUTS       24

// On-board LED pin number
#define LED_BUILTIN             PA5

// On-board user button
#define USER_BTN                PA0

#define PIN_SPI_SS                  PA15
#define PIN_SPI_MOSI                PB5
#define PIN_SPI_MISO                PB4
#define PIN_SPI_SCK                 PB3

// I2C definitions
#define PIN_WIRE_SDA                PB7      
#define PIN_WIRE_SCL                PB6

// Timer Definitions
// Use TIM6/TIM7 when possible as servo and tone don't need GPIO output pin
#define TIMER_TONE              TIM6
#define TIMER_SERVO             TIM7

// UART Definitions
#define SERIAL_UART_INSTANCE    2 //Connected to ST-Link

// Serial pin used for console (ex: stlink)
// Rerquired by Firmata
#define PIN_SERIAL_RX           PD6
#define PIN_SERIAL_TX           PD5

/* Extra HAL modules */
#define HAL_DAC_MODULE_ENABLED
#define HAL_ETH_MODULE_ENABLED

#ifdef __cplusplus
} // extern "C"
#endif
/*----------------------------------------------------------------------------
 *        Arduino objects - C++ only
 *----------------------------------------------------------------------------*/

#ifdef __cplusplus
  // These serial port names are intended to allow libraries and architecture-neutral
  // sketches to automatically default to the correct port name for a particular type
  // of use.  For example, a GPS module would normally connect to SERIAL_PORT_HARDWARE_OPEN,
  // the first hardware serial port whose RX/TX pins are not dedicated to another use.
  //
  // SERIAL_PORT_MONITOR        Port which normally prints to the Arduino Serial Monitor
  //
  // SERIAL_PORT_USBVIRTUAL     Port which is USB virtual serial
  //
  // SERIAL_PORT_LINUXBRIDGE    Port which connects to a Linux system via Bridge library
  //
  // SERIAL_PORT_HARDWARE       Hardware serial port, physical RX & TX pins.
  //
  // SERIAL_PORT_HARDWARE_OPEN  Hardware serial ports which are open for use.  Their RX & TX
  //                            pins are NOT connected to anything by default.
  #define SERIAL_PORT_MONITOR     Serial
  #define SERIAL_PORT_HARDWARE    Serial
#endif

#endif /* _VARIANT_ARDUINO_STM32_ */
